#include <stdio.h>

/*
 * Задание №1: калькулятор, защищённый от деления на ноль

  Задание такое же, как задание №2: калькулятор в предыдущей группе заданий,
но дополнительно необходимо защитить калькулятор от деления на ноль.

  Если пользователь вводит число ноль в значение второго аргумента,
нужно вывести осмысленное сообщение по этому поводу
вместо результатов операций деления и остатка от деления.

  Все остальные операции должны работать так же, как и в предыдущей задаче.

 */

void f1_zerocalc() {

    int x, y;

    scanf("%d %d", &x, &y);

    printf("Арифметические операции\n");
    printf("%d + %d = %d\n", x, y, x + y);
    printf("%d - %d = %d\n", x, y, x - y);
    printf("%d * %d = %d\n", x, y, x * y);
    if (y) {
        printf("%d / %d = %d\n", x, y, x / y);
        printf("%d %% %d = %d\n\n", x, y, x % y);
    } else {
        printf("На ноль делить нельзя!!!\n\n");
    }

    printf("Операторы сравнения\n");
    printf("%d == %d = %d\n", x, y, x == y);
    printf("%d != %d = %d\n", x, y, x != y);
    printf("%d > %d = %d\n", x, y, x > y);
    printf("%d < %d = %d\n", x, y, x < y);
    printf("%d >= %d = %d\n", x, y, x >= y);
    printf("%d <= %d = %d\n\n", x, y, x <= y);

    printf("Логические операции\n");
    printf("%d && %d = %d\n", x, y, x && y);
    printf("%d || %d = %d\n", x, y, x || y);
    printf("!%d = %d\n\n", x, !x);

    printf("Логические (побитовые)\n");
    printf("%d & %d = %d\n", x, y, x & y);
    printf("%d | %d = %d\n", x, y, x | y);
    printf("%d ^ %d = %d\n", x, y, x ^ y);
    printf("~%d = %d\n\n", x, ~x);

    printf("Побитовые сдвиги\n");
    printf("%d << %d = %d\n", x, y, x << y);
    printf("%d >> %d = %d\n", x, y, x >> y);

}