#include <stdio.h>

/*
 * Задание №1: hello, world

Напечатать на экран строку “Hello, world!”,
перевести строку и закончить работу программы.
 */

void f1_helloworld() {
    printf("Hello, world!\n");
}